tutorials/multiphaseEuler/Grossetete/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    basicMultiphaseSystem;

phases (gas liquid);

gas
{
    type            pureIsothermalPhaseModel;

    diameterModel   constant;

    constantCoeffs
    {
        d               0.0034;
    }

    residualAlpha   1e-6;
}

liquid
{
    type            pureIsothermalPhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

drag
{
    gas_dispersedIn_liquid
    {
        type            IshiiZuber;
    }
}

virtualMass
{
    gas_dispersedIn_liquid
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{
    gas_dispersedIn_liquid
    {
        type RanzMarshall;
    }
}

lift
{
    gas_dispersedIn_liquid
    {
        type wallDamped;

        lift
        {
            type Tomiyama;
            Cl 0.288;

            aspectRatio
            {
                type constant;
                E0 1;
            }
        }

        wallDamping
        {
            type    cosine;
            Cd      1.0;
            zeroInNearWallCells yes;
        }
    }
}

wallLubrication
{
    gas_dispersedIn_liquid
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }
}

turbulentDispersion
{
    gas_dispersedIn_liquid
    {
        type                Burns;
        sigma               0.7;
    }
}

blending
{
    default
    {
        type            continuous;
        phase           liquid;
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.071;
    }
}

phaseTransfer
{}

interfaceCompression
{}

// ************************************************************************* //
